## 我的開放原始碼之路

在 2000 年之前，我幾乎都只會用微軟等公司所推出的商用軟體，但是自從在松下 PTL 兼差研發程式之後，慢慢的接觸到了開放原始碼工具，特別是像 make 與 gcc 等以 C語言為核心的開發工具，當時只覺得這些東西好原始，為何不像微軟的 Visual Studio 那樣有完整的開發環境，不過還好用了一陣子也就習慣了。

後來我進入金門大學任教之後，有一次在台東舉辦的研討會上，聽到了洪朝貴老師講述開放原始碼軟體，當時對這些東西也沒什麼特別的好感，但卻開始逐漸理解隱藏在開源軟體背後的理念。

後來為了要在學校上課，又不想使用破解的盜版軟體，於是開始試用了一些開放原始碼工具，像是用 blender 來教動畫設計、用 R 來教機率統計、用 Icarus Verilog 來教計算機結構等等。

經過這些年的『邊學邊教』的過程之後，我逐漸的認識了這個紛亂而多元的領域，也慢慢的在這個領域裡可以創建一些專案了。像是最近創建了 wikidown.js 維基網誌, jslab 機率統計平台, 與 elearn 英文學習系統等等。

雖然身在金門這個比較偏遠的環境，但是在寒暑假時我會回去看看有沒有什麼黑客松或程式相關研討會可以參加，目前曾經參加過兩次的 COSCUP 開源人年會與一次的 SITCON 學生計算機年會，這些活動對我進一步學習開放原始碼，以及認識程式領域的朋友都很有幫助，也建議剛入門的朋友可以多參加這些活動，相信也會收穫良多的。

最近我開始透過 Kubuntu 系統學習 Linux，因為 Linux 可以說是存取開放原始碼資源的一扇窗口，就像英文是吸取全世界知識的一扇窗口一樣，我相信透過 Linux 可以帶領我進一步深入開放原始碼的世界。

另外我開始嘗試用 node.js+JavaScript 來教授『網路程式設計』課程與實作「人工智慧、系統程式」等課程的相關程式，慢慢的開始移向 Javascript 這個語言與相關的開發環境，並打算改用 JavaScript 來教授大一新生第一學期的程式設計課程，然後在第二學期再改用 C/C++ 以便讓同學銜接嵌入式系統的領域。希望透過 JavaScript 的引導讓我的學生們更容易的進入程式設計的領域，而不會被生硬的C 語言卡住，造成學習上的瓶頸。

身為一個大學老師，我不喜歡作高深的學術研究，相反的、我喜歡透過分享一些自己寫的程式，讓學生們找到自己的開源之路，成為一名專業的程式設計師，讓他們有能力透過程式改變這個世界！




