## 精彩的專利問答集 (作者：研發養成所 Bridan)

最近個人重新研讀 [專利，就是科技競爭力](http://4rdp.blogspot.tw/2008/03/blog-post_04.html) 一書，以下用自問自答方式整理重點，讀者可以參考看看：

ㄧ、專利的要件須甚麼？
答：請參考 [專利種類、要件與搜尋](http://4rdp.blogspot.tw/2011/05/blog-post.html) 。

二、專利在保護甚麼？如果不申請會怎樣？
答：專利在保護「概念」。申請專利就必須將相關技術對外公開，如果不申請則視為營業秘密，像可口可樂就是將配方以營業秘密處理不公開。如果看見有人用相同概念應用於類似商品上，沒申請則無法保護權益。

三、什麼樣的專利值得申請？何時專利申請比較好？
答：具有市場潛在價值。專利申請越早越好，因為專利採登記制，誰越早登記就是誰的，而且要在公開之前，因為東西公開後，申請專利就不會核准 (少新穎性)，最慢商品上市半年內要申請。

四、取得專利能做甚麼？

答：專利是一種排他性的「智慧財產權」，基本上有四種權力：製造權、販賣權 (包含販賣之要約)、使用權、進口權，可以禁止他人生產、販賣或進口產品 (只要有用到你的專利)，要求賠償損失，可以授權，也可以販售專利權。取得專利後，權利並不會自動產生利益，必須自己去找買家或以訴訟方式請求侵權賠償。

五、台灣的專利在國外有效嗎？
答：專利採屬地主義，僅限申請的保護地。

六、專利有效期限多久？
答：發明專利有效 20 年，新型專利各國規定不同 6 ~ 12 年，設計專利 (新式樣專利) 各國規定不同約 10 年，從申請日起算，但權力由證書取得日開始。

七、專利申請有什麼費用？
答：請事務所代為撰寫服務費用 (25000 ~ 35000元)、智財局申請規費 (10500元)、請求早期公開規費 (1000元)，審查答辯每次 (8000 ~20000元)，領取證書要領證規費 (1000元)，然後每年要繳維持規費 (個人 1700元，公司 2500元)。申請大陸約 55000 元，審查答辯每次 25000 ~35000元，領證 25000 ~ 35000元。
美國申請 68000 ~ 78000元，審查答辯每次 50000 ~65000元，領證 55000元，以上是目前的大約行情。歐洲至少要申請三個國家才能全歐盟，那申請就要三十萬元，其他費用則類似美國。所以專利大多是公司在申請，個人很少因為要花很多錢。如果資金有限，建議以台陸美申請就好，因為陸美人口多並且國民生產毛額 (GDP)大，考量平價購買力，這樣投資 CP 值較高。

八、專利申請流程為何？約需多久才可以領取證書？
答：台灣採「早期公開，請求審查」，美國採「早期公開，自動審查」，申請專利後 18 個月左右，會在「公開公報」刊登專利內容，並給暫准專利權，當專利獲准後，專利人可以請求公開期之後被侵權的損失。申請人提出請求審查並繳審查費，機關才會開始審查，通常申請 2 ~ 5 年間提出「請求審查」。因此從專利申請到通過，等三年時間是常見的事。歐洲專利有「公眾審查制」，就是公告核准 3 ~ 6 個月，看有沒有人異議，沒有才頒證。美國沒有這種制度。

九、專利會被撤銷嗎？
答：會，不是每年繳維持費就沒事，如果有人主張你的專利不符「專利要件」(如缺少有用性、新穎性、進步性)，並且法院撤銷專利勝訴，一旦專利撤銷，朔及既往自始不存在。

十、如果有權利金收入要繳稅嗎？(限個人專利無關公司)
答：要，假設 103 年授權他人使用專利，獲得一百萬元收入，這稱為權利金收益，它可以扣除必要列舉費用後 (無列舉者以 20% 費用推定)，100 x (100% - 20%) = 80 萬元，視為當年綜合所得一次性收入。
現在促進產業升級條例已經廢除，因此沒有第11條就其出售所得之50%免予計入綜合所得額課稅的優惠。

十一、專利說明書內容要寫甚麼？重點是什麼？
答：要把想法寫出具體做法，包含摘要(5%篇幅比例，重要性一星)、本發明之背景(10%  三星)、本發明之簡介及其目的和效果(10%  三星)、圖式簡單說明(2%  一星)、 *較佳具體實施例之詳細說明(40%  四星)* 、 **申請專利範圍(claim)(15%  六星)** 、圖式(18%  三星)。

十二、申請專利範圍包含那些內容？
答：包含獨立項與附屬項，至少需要一個獨立項，它是必要的主項，附屬項則是選項，是附帶要求。申請專利範圍限制條件越多，權利範圍越小。注意有三項因素會限縮申請專利範圍的大小 ─ 既有技術、發明之必要要件列出、越少專利說明書的具體實施例 (舉例越多範圍越大)。

十三、專利侵權如何分析？
答：請參考 [專利侵權](http://4rdp.blogspot.tw/2011/06/blog-post.html) 。

十四、如何判斷發明是否具備進步性？
答：假設以前類似的發明物件需要 A+B+C+D 四樣東西達成，但現在只需 A+B+E 三樣，哪就有進步。

十五、如何判斷發明是否具備新穎性？
答：假設以前類似的發明物件需要 A+B+C 三樣東西，但現在申請的是 A+B+D，哪就有差異。

十六、發明人與申請人有甚麼差別？
答：發明人必須是自然人，而且是發明者本人，這是為了表彰發明者對世界的貢獻，美國如果發現有他人代假，就會撤銷專利。申請人可以是自然人也可以是法人，表示可以非發明者本人。

十七、受僱人在業餘研究發明，歸屬個人還是公司？
答：視發明內容而定，簡單的說，受雇人的發明跟現在工作內容或領域無關，那權力歸屬個人，如果是下班後自己弄，也沒用到公司任何資源，那當然100%屬於你，如果有用到公司資源，那公司是可以請求你給付費用或以合理報酬換取你的發明。但如果發明與現在工作有關，即使是利用下班時間做，這都歸屬公司的，而且應書面通告公司發明事宜，如果未通告這種情形受僱人會敗訴。詳見 [專利法第八條](http://lis.ly.gov.tw/lgcgi/lglaw?@261:1804289383:f:NO%3DC701924*%20OR%20NO%3DC001924%20OR%20NO%3DC101924$$4$$$NO) 。 *如果是出資研究的合約關係，發明歸屬則依合約規定* 。

十八、我有個專利就可以保障產品製造銷售？
答：錯，例如 DVD 有十幾項專利，SONY 有其中一部分，但它仍需對其他專利權人付出權利金以取得授權生產銷售。

結論，希望能翻身脫離 22k，發明是一條合法途徑，不過也要有點錢才能玩，更慘的是，跟工作有所關連，專利不是你的。